In [1]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\prath\anaconda3\lib\site-packages (1.3.20)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.1.0-cp38-cp38-win_amd64.whl (180 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.0
Note: you may need to restart the kernel to use updated packages.

In [5]:
import sqlalchemy as db

#Establishing connection with the database.
engine = db.create_engine('mysql://root:2000@localhost/Organization')

connection = engine.connect()
metadata = db.MetaData()

In [8]:
employee = db.Table('employee', metadata, autoload=True, autoload_with=engine)

In [9]:
import pandas as pd

query = db.select([employee]) 
ResultProxy = connection.execute(query)
Result = ResultProxy.fetchall()
df = pd.DataFrame(Result, columns = Result[0].keys())

In [10]:
df

   id  empname  salary  departmentid
0   1    Parth   15000           100
1   2  Pranjal   10000           200
2   3    Arnav  100000           200
3   4    Rahul  150000           300
4   5   Manish   25000           100
5   6   Kunwar   10000           200
6   7  Rishabh  100000           200
7   8   Deepak  150000           300
8   9    Rohit   25000           400
9  10  Kshitij   10000           200

In [14]:
query = db.select([employee.columns.empname, employee.columns.salary]).where(employee.columns.salary > 5000)
resultproxy2 = connection.execute(query)
result2 = resultproxy2.fetchall()
df2 = pd.DataFrame(result2, columns = result2[0].keys())
df2

   empname  salary
0    Parth   15000
1  Pranjal   10000
2    Arnav  100000
3    Rahul  150000
4   Manish   25000
5   Kunwar   10000
6  Rishabh  100000
7   Deepak  150000
8    Rohit   25000
9  Kshitij   10000

In [16]:
query = db.select([employee.columns.empname.distinct()])
resultproxy3 = connection.execute(query)
result3 = resultproxy3.fetchall()
df3 = pd.DataFrame(result3, columns = ["Name"])
df3

      Name
0    Parth
1  Pranjal
2    Arnav
3    Rahul
4   Manish
5   Kunwar
6  Rishabh
7   Deepak
8    Rohit
9  Kshitij

In [18]:
query = db.select([employee.columns.empname, employee.columns.salary]).where(employee.columns.salary.in_([2500, 6500, 10000]))
resultproxy4 = connection.execute(query)
result4 = resultproxy4.fetchall()
df4 = pd.DataFrame(result4, columns = result4[0].keys())
df4

   empname  salary
0  Pranjal   10000
1   Kunwar   10000
2  Kshitij   10000

In [21]:
query = db.select([employee.columns.departmentid, db.func.count(employee.columns.empname).label("count")]).group_by(employee.columns.departmentid)
resultproxy5 = connection.execute(query)
result5 = resultproxy5.fetchall()
df5 = pd.DataFrame(result5, columns = result5[0].keys())
df5

   departmentid  count
0           100      2
1           200      5
2           300      2
3           400      1

In [22]:
query = db.select([employee]).order_by(employee.columns.salary)
resultproxy6 = connection.execute(query)
result6 = resultproxy6.fetchall()
df6 = pd.DataFrame(result6, columns = result6[0].keys())
df6

   id  empname  salary  departmentid
0   2  Pranjal   10000           200
1   6   Kunwar   10000           200
2  10  Kshitij   10000           200
3   1    Parth   15000           100
4   5   Manish   25000           100
5   9    Rohit   25000           400
6   3    Arnav  100000           200
7   7  Rishabh  100000           200
8   4    Rahul  150000           300
9   8   Deepak  150000           300